// 0. Напишите программу, которая на вход принимает число и выдает его квадрат 
// (число умноженное на само себя).

Console.WriteLine("Write a number: ");
string s_num = Console.ReadLine();

int num = int.Parse(s_num);
Console.WriteLine(num*num);
